# Space Property (Phase)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..Space Property (Phase)
FamilyInstance Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Space this[
	Phase phase
] { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Space ( _
	phase As Phase _
) As Space
	Get
```

Visual C++
---
```text
public:
property Space^ Space[Phase^ phase] {
	Space^ get (Phase^ phase);
}
```

# ### Parameters
phase
    Type: Autodesk.Revit.DB..::..Phase
# See Also
FamilyInstance Class
Space Overload
Autodesk.Revit.DB Namespace